//=============================================================================
//
// ビーム処理 [beam.h]
// Author : TAKUTO ISHIDA
//
//=============================================================================
#ifndef _BEAM_H_
#define _BEAM_H_

#include "main.h"

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXCOLOR col;		//色
	int nCntGauge;		//ゲージの蓄積量
} BEAM;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitBeam(void);
void UninitBeam(void);
void UpdateBeam(void);
void DrawBeam(void);

void AddBeam(int nValue);
BEAM *GetBeam(void);

#endif
