//=============================================================================
//
// 体力処理 [life.h]
// Author : TAKUTO ISHIDA
//
//=============================================================================
#ifndef _LIFE_H_
#define _LIFE_H_

#include "main.h"

//=============================================================================
// 構造体定義
//=============================================================================
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	int nCntLife;		//体力
	bool bUse;			//使用しているかどうか
}LIFE;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitLife(void);
void UninitLife(void);
void UpdateLife(void);
void DrawLife(void);

void SubtractionLife(int nValue);
LIFE *GetLife(void);

#endif
