//=============================================================================
//
// プレイヤー処理 [player.h]
// Author : TAKUTO ISHIDA
//
//=============================================================================
#ifndef _PLAYER_H_
#define _PLAYER_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3		pos;					// 位置
	D3DXVECTOR3		move;					// 移動量
	D3DXVECTOR3		rot;					// 現在の角度
	D3DXVECTOR3		angle;					// 角度
	float			fSpeed;					// 速度調整
	float			fDestAngle;				// 目的の角度
	float			fDiffAngle;				// 差分の角度
	bool			bJump;					// ジャンプをしているか
}Player;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitPlayer(void);
void UninitPlayer(void);
void UpdatePlayer(void);
void DrawPlayer(void);

Player *GetPlayer(void);

#endif
