//=============================================================================
//
// 体力処理 [life.h]
// Author : Ishida Takuto
//
//=============================================================================
#ifndef _LIFE_H_
#define _LIFE_H_

#include "scene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_POLYGON_LIFE	(3)		// ポリゴンの最大数
#define MAX_LIFE			(100)	// ライフの上限

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CPolygon;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CLife : public CScene
{
public:
	CLife(int nPriority = 6);
	~CLife();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CLife* Create(void);

	const void AddSubtract(int nValue);		// ライフを増減させる
	int GetLife(void) { return m_nLife; };	// ライフの取得

private:
	CPolygon *m_pPolygon[MAX_POLYGON_LIFE];	// ポリゴンクラスのポインタ変数
	int m_nLife;							// 現在のライフの値(最前の緑バー)
	int m_nCntSubtraction;					// ダメージバーを減らし始めるまでのカウンタ
};

#endif
