//=============================================================================
//
// ポーズメニュー処理 [pause.h]
// Author : Ishida Takuto
//
//=============================================================================
#ifndef _PAUSE_H_
#define _PAUSE_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CPolygon;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CPause
{
public:
	//*****************************************************************************
	// ポーズメニュー
	//*****************************************************************************
	typedef enum
	{
		TYPE_CONTINUE = 0,
		TYPE_RETRY,
		TYPE_QUIT,
		TYPE_MAX
	}TYPE;

	CPause();
	~CPause();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CPause* Create(void);

	static HRESULT Load(void);				// テクスチャを読み込む
	static void Unload(void);				// 読み込んだテクスチャを解放

private:
	void Select(void);

	CPolygon *m_apPolygon[TYPE_MAX + 1];
	int m_nNumSelect;		// 現在の状態
};

#endif