//=============================================================================
//
// タイトル処理 [title.h]
// Author : Ishida Takuto
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

#include "main.h"
#include "field.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TITLE_POLYGON	(2)		// タイトルに使うポリゴンの数

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CPolygon;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTitle
{
public:
	CTitle();
	~CTitle();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CField *GetField(int nIndex) { return m_pField[nIndex]; };	// フィールドの取得

private:
	static CPolygon *m_apPolygon[TITLE_POLYGON];	// ポリゴンクラスのポインタ変数
	static CField	*m_pField[MAX_FIELD];			// フィールドクラスのポインタ変数
	int				m_nCntEnemyAppear;				// 敵を出現させるカウンタ
	int				m_nCntTitle;					// タイトル時間のカウンタ
};

#endif