#pragma once
//=============================================================================
//
// クレジット処理 [credit.h]
// Author : 
//
//=============================================================================
#ifndef _CREDIT_H_
#define _CREDIT_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitCredit(void);
void UninitCredit(void);
void UpdateCredit(void);
void DrawCredit(void);

#endif