//=============================================================================
//
// エンドロール処理 [endroll.h]
// Author : 
//
//=============================================================================
#ifndef _ENDROLL_H_
#define _ENDROLL_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitEndRoll(void);
void UninitEndRoll(void);
void UpdateEndRoll(void);
void DrawEndRoll(void);

#endif