//=============================================================================
//
// メッシュフィールド処理 [meshField.h]
// Author : Ishida Takuto
//
//=============================================================================
#ifndef _MESHFIELD_H_
#define _MESHFIELD_H_

#include "scene3DIndex.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CMeshField : public CScene3DIndex
{
public:
	CMeshField();
	~CMeshField();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CMeshField* Create(void);

	static HRESULT Load(void);				// テクスチャを読み込む（managerにいれる）
	static void Unload(void);				// 読み込んだテクスチャを解放

private:
	static LPDIRECT3DTEXTURE9 *m_pTexture;	// 共有テクスチャへのポインタ
	static int m_nNumTex;	// テクスチャ数
	int m_nType;			// テクスチャの種類
	int m_nWire;			// ワイヤーフレームを表示するか
};

#endif
