//=============================================================================
//
// ロゴの処理 [logo.cpp]
// Author : Takuto Ishida
//
//=============================================================================
#include "logo.h"
#include "manager.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define PRESS_TEXTURE		"data/TEXTURE/press_any.png"
#define TUTORIAL_TEXTURE	"data/TEXTURE/tutorial.png"

//*****************************************************************************
// 静的メンバ変数宣言
//*****************************************************************************

//=============================================================================
// 生成処理
//=============================================================================
CLogo* CLogo::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CLogo *pLogo = NULL;	// ロゴクラスのポインタ変数

	pLogo = new CLogo;		// メモリを確保

	if (NULL != pLogo)
	{// メモリを確保できた
		pLogo->Init();						// 初期化処理
		pLogo->SetPos(pos + D3DXVECTOR3(-fWidth * 0.5f, -fHeight * 0.5f, 0.0f));	// 位置の設定
		pLogo->SetSize(fWidth, fHeight);	// サイズの設定
	}

	return pLogo;
}

//=============================================================================
// テクスチャを割り当てる
//=============================================================================
void CLogo::BindTexture(LPDIRECT3DTEXTURE9 pTexture)
{
	CScene2D::BindTexture(pTexture);	// テクスチャの割り当て
}

//=============================================================================
// コンストラクタ
//=============================================================================
CLogo::CLogo(int nPriority, CScene::OBJTYPE objType) : CScene2D(nPriority, objType)
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CLogo::~CLogo()
{
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CLogo::Init(void)
{
	// 初期化処理
	CScene2D::Init();

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CLogo::Uninit(void)
{
	// オブジェクトを破棄
	CScene2D::Uninit();
}

//=============================================================================
// 更新処理
//=============================================================================
void CLogo::Update(void)
{
}

//=============================================================================
// 描画処理
//=============================================================================
void CLogo::Draw(void)
{
	CScene2D::Draw();	// 描画処理
}

/*==================================================*/
/*			  ボタン入力待ち表示クラス				*/
/*==================================================*/
//=============================================================================
// 生成処理
//=============================================================================
CLogoPressButton* CLogoPressButton::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CLogoPressButton *pLogoPressButtion = NULL;	// ロゴクラスのポインタ変数

	pLogoPressButtion = new CLogoPressButton;		// メモリを確保

	if (NULL != pLogoPressButtion)
	{// メモリを確保できた
		pLogoPressButtion->Init();						// 初期化処理
		pLogoPressButtion->SetPos(pos + D3DXVECTOR3(-fWidth * 0.5f, -fHeight * 0.5f, 0.0f));	// 位置の設定
		pLogoPressButtion->SetSize(fWidth, fHeight);	// サイズの設定
	}

	return pLogoPressButtion;
}

//=============================================================================
// コンストラクタ
//=============================================================================
CLogoPressButton::CLogoPressButton(int nPriority, CScene::OBJTYPE objType) : CLogo(nPriority, objType)
{
	m_pTexture = NULL;
	m_nCntFlash = 0;
}

//=============================================================================
// デストラクタ
//=============================================================================
CLogoPressButton::~CLogoPressButton()
{
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CLogoPressButton::Init(void)
{
	// 初期化処理
	CLogo::Init();

	// デバイスの取得
	CRenderer *pRenderer = CManager::GetRenderer();
	LPDIRECT3DDEVICE9 pDevice;
	pDevice = pRenderer->GetDevice();

	// テクスチャの生成
	D3DXCreateTextureFromFile(pDevice, PRESS_TEXTURE, &m_pTexture);
	CLogo::BindTexture(m_pTexture);								// テクスチャの設定

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CLogoPressButton::Uninit(void)
{
	if (NULL != m_pTexture)
	{// テクスチャの開放
		m_pTexture->Release();
		m_pTexture = NULL;
	}

	// オブジェクトを破棄
	CLogo::Uninit();
}

//=============================================================================
// 更新処理
//=============================================================================
void CLogoPressButton::Update(void)
{
}

//=============================================================================
// 描画処理
//=============================================================================
void CLogoPressButton::Draw(void)
{
	// 描画処理
	CLogo::Draw();
}

//=============================================================================
// 点滅処理
//=============================================================================
void CLogoPressButton::Flashing(int nFlame)
{
	// 色の取得
	D3DXCOLOR col = CLogo::GetColor();

	// 指定したフレームで
	if (m_nCntFlash < nFlame)
	{// 透明にする
		col.a -= 1.0f / nFlame;
	}
	else
	{// 不透明にする
		col.a += 1.0f / nFlame;
	}

	m_nCntFlash = (1 + m_nCntFlash) % (nFlame * 2);		// カウントを進める

	if (col.a <= 0)
	{// アルファ値が０以下のとき
		col.a = 0;
		m_nCntFlash = nFlame;
	}
	else if (col.a >= 1)
	{// アルファ値が１以上のとき
		col.a = 1;
		m_nCntFlash = 0;
	}

	// 色の設定
	CLogo::SetColor(col);
}

/*==================================================*/
/*				  操作説明表示クラス				*/
/*==================================================*/
//=============================================================================
// 生成処理
//=============================================================================
CLogoTutorial* CLogoTutorial::Create(D3DXVECTOR3 pos, float fWidth, float fHeight)
{
	CLogoTutorial *pLogoPressButtion = NULL;	// ロゴクラスのポインタ変数

	pLogoPressButtion = new CLogoTutorial;		// メモリを確保

	if (NULL != pLogoPressButtion)
	{// メモリを確保できた
		pLogoPressButtion->Init();						// 初期化処理
		pLogoPressButtion->SetPos(pos + D3DXVECTOR3(-fWidth * 0.5f, -fHeight * 0.5f, 0.0f));	// 位置の設定
		pLogoPressButtion->SetSize(fWidth, fHeight);	// サイズの設定
	}

	return pLogoPressButtion;
}

//=============================================================================
// コンストラクタ
//=============================================================================
CLogoTutorial::CLogoTutorial(int nPriority, CScene::OBJTYPE objType) : CLogo(nPriority, objType)
{
	m_pTexture = NULL;
}

//=============================================================================
// デストラクタ
//=============================================================================
CLogoTutorial::~CLogoTutorial()
{
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CLogoTutorial::Init(void)
{
	// 初期化処理
	CLogo::Init();

	// デバイスの取得
	CRenderer *pRenderer = CManager::GetRenderer();
	LPDIRECT3DDEVICE9 pDevice;
	pDevice = pRenderer->GetDevice();

	// テクスチャの生成
	D3DXCreateTextureFromFile(pDevice, TUTORIAL_TEXTURE, &m_pTexture);
	CLogo::BindTexture(m_pTexture);		// テクスチャの設定

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CLogoTutorial::Uninit(void)
{
	if (NULL != m_pTexture)
	{// テクスチャの開放
		m_pTexture->Release();
		m_pTexture = NULL;
	}

	// オブジェクトを破棄
	CLogo::Uninit();
}

//=============================================================================
// 更新処理
//=============================================================================
void CLogoTutorial::Update(void)
{
}

//=============================================================================
// 描画処理
//=============================================================================
void CLogoTutorial::Draw(void)
{
	// 描画処理
	CLogo::Draw();
}
