//=============================================================================
//
// タイトル処理 [title.h]
// Author : Takuto Ishida
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

#include "scene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TITLE_POLYGON	(2)		// タイトルに使うポリゴンの数
#define TITLE_NUM_BG	(2)		// 背景の数

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CLogo;
class CLogoPressButton;
class CBg;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTitle : public CScene
{
public:
	CTitle();
	~CTitle();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:
	int					m_nCntTitle;			// タイトル時間のカウンタ
	int					m_nFlash;				// 点滅用
	CLogo				*m_pLogo;				// ロゴ
	CLogoPressButton	*m_pPressButton;		// 入力待ち表示

	CBg *m_pBg[TITLE_NUM_BG];	// 背景のポインタ変数
	CBg *m_pMountain;			// 背景の山
};

#endif