//=============================================================================
//
// コンボ処理 [combo.h]
// Author : TAKUTO ISHIDA
//
//=============================================================================
#ifndef _COMBO_H_
#define _COMBO_H_

#include "main.h"

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;
	D3DXCOLOR col;
	int nType;
}Combo;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitCombo(D3DXVECTOR3 pos);
void UninitCombo(void);
void UpdateCombo(void);
void DrawCombo(void);

void AddCombo(void);
void AddKillCombo(void);

#endif
