//=============================================================================
//
// キルログ処理 [killLog.h]
// Author : TAKUTO ISHIDA
//
//=============================================================================
#ifndef _KILLLOG_H_
#define _KILLLOG_H_

#include "main.h"

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;
	D3DXCOLOR col;
	int nType;
}KILLLOG;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitKillLog(void);
void UninitKillLog(void);
void UpdateKillLog(void);
void DrawKillLog(void);

void AddKill(void);

#endif
