//=============================================================================
//
// 体力処理 [life.h]
// Author : TAKUTO ISHIDA
//
//=============================================================================
#ifndef _LIFE_H_
#define _LIFE_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_LIFE		(10)	// ライフの上限

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;		// 左上の位置
	D3DXCOLOR col;			// 色
	int nLife;				// 現在のライフ
	float fLength;			// バーの長さ	[0:現在のライフ　1:ダメージで減った分]
	int nType;				// テクスチャの種類（-1でなし）
}Life;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitLife(void);
void UninitLife(void);
void UpdateLife(void);
void DrawLife(void);


void AddSubtractLife(int nValue);		// ライフを増減させる
int GetLife(void);	// ライフの取得

#endif
