//=============================================================================
//
// ポリゴン処理 [wall.h]
// Author : 有馬　武志
//
//=============================================================================
#ifndef _WALL_H_
#define _WALL_H_

#include "main.h"

//*****************************************************************************
// 壁の構造体
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3		posWall;		//位置
	D3DXVECTOR3		rotWall;		//向き
	D3DXMATRIX		mtxWorldWall;	//ワールドマトリックス
	D3DXVECTOR3		moveWall;		//種類
	bool			bUse;			//使用してるかどうか
}Wall;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitWall(void);
void UninitWall(void);
void UpdateWall(void);
void DrawWall(void);

void SetWall(D3DXVECTOR3 pos,D3DXVECTOR3 rot);

#endif
