//=============================================================================
//
// ゲームオーバー処理 [gameover.h]
// Author : TAKUTO ISHIDA
//
//=============================================================================
#ifndef _GAMEOVER_H_
#define _GAMEOVER_H_

#include "main.h"
#include "input.h"

//=============================================================================
// 構造体定義
//=============================================================================
typedef struct
{
	D3DXVECTOR3 pos;
	int nType;
}GAMEOVER;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitGameover(void);
void UninitGameover(void);
void UpdateGameover(void);
void DrawGameover(void);

#endif