//=============================================================================
//
// ポーズ処理 [pausebg.h]
// Author : TAKUTO ISHIDA
//
//=============================================================================
#ifndef _PAUSEBG_H_
#define _PAUSEBG_H_

#include "main.h"

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXCOLOR col;		//色
	int nCountAnim;
} PAUSEBG;


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitPausebg(void);
void UninitPausebg(void);
void UpdatePausebg(void);
void DrawPausebg(void);

#endif